In [1]:
import numpy as np
import pandas as pd

In [21]:
d = {'a':[1,2,3],'b':[1,2,np.nan],'c':[1,np.nan,np.nan]}
df  = pd.DataFrame(d)
df

   a    b    c
0  1  1.0  1.0
1  2  2.0  NaN
2  3  NaN  NaN

## Deleting the missing data

In [6]:
df.dropna()             ##deleting rows having atleast 1 NAN/null. And it doesn't effect original df

   a    b    c
0  1  1.0  1.0

In [7]:
df.dropna(axis=1)

   a
0  1
1  2
2  3

In [9]:
df.dropna(thresh=2)        #Deleting rows which doesn't have atleast 2 non NaN

   a    b    c
0  1  1.0  1.0
1  2  2.0  NaN

In [20]:
df.dropna(axis=1, thresh=3)

   a
0  1
1  2
2  3

## Filling missing data

In [22]:
df.fillna(value='Hii')

   a    b    c
0  1  1.0  1.0
1  2  2.0  Hii
2  3  Hii  Hii

In [23]:
df

   a    b    c
0  1  1.0  1.0
1  2  2.0  NaN
2  3  NaN  NaN

In [26]:
df['b'].fillna(value='Hii')

0    1.0
1    2.0
2    Hii
Name: b, dtype: object

In [28]:
df.iloc[2].fillna(value='Hello')

a      3.0
b    Hello
c    Hello
Name: 2, dtype: object

# Group By

In [34]:
import pandas as pd
d= {'company':['a','b','c','a','c'], 'person':['v','w','x','y','z'],'sales':[100,200,300,400,500]}
df = pd.DataFrame(d)
df

  company person  sales
0       a      v    100
1       b      w    200
2       c      x    300
3       a      y    400
4       c      z    500

In [37]:
a = df.groupby('company')

In [39]:
a.mean()

         sales
company
a        250.0
b        200.0
c        400.0

In [40]:
a.sum()

         sales
company
a          500
b          200
c          800

In [41]:
a.std()

              sales
company
a        212.132034
b               NaN
c        141.421356

In [42]:
a.sum().loc['a']

sales    500
Name: a, dtype: int64

In [44]:
a.count()

         person  sales
company
a             2      2
b             1      1
c             2      2

In [45]:
a.max()

        person  sales
company
a            y    400
b            w    200
c            z    500

In [47]:
b = df.groupby('company').describe()
b

        sales
        count   mean         std    min    25%    50%    75%    max
company
a         2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0
b         1.0  200.0         NaN  200.0  200.0  200.0  200.0  200.0
c         2.0  400.0  141.421356  300.0  350.0  400.0  450.0  500.0

In [48]:
b.transpose()

company               a      b           c
sales count    2.000000    1.0    2.000000
      mean   250.000000  200.0  400.000000
      std    212.132034    NaN  141.421356
      min    100.000000  200.0  300.000000
      25%    175.000000  200.0  350.000000
      50%    250.000000  200.0  400.000000
      75%    325.000000  200.0  450.000000
      max    400.000000  200.0  500.000000

In [49]:
b.transpose()['a']

sales  count      2.000000
       mean     250.000000
       std      212.132034
       min      100.000000
       25%      175.000000
       50%      250.000000
       75%      325.000000
       max      400.000000
Name: a, dtype: float64

In [53]:
b.transpose().loc['sales'].loc['max']

company
a    400.0
b    200.0
c    500.0
Name: max, dtype: float64